Troubleshooting, still not functional.
